Case_2/1mainRun/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiphaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         8;

deltaT          2e-4;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  no;

maxCo           0.9;

maxDeltaT       5e-04;

functions
{
	OutletValue
	{
		type surfaceFieldValue;
		functionObjectLibs ("libfieldFunctionObjects.so");
		writeControl		writeTime;
		fields
		(
			HF.gas
			HF_s.gas
			alpha.gas
			Ar.ga
			p
		);
		operation 		average;
		regionType		patch;
		name			outlet;
		writeFields		false;
		writeInterval	1;					// just added
	}
}
libs
( 
	"libmyAdsorptionArrheniusReactions.so"
	"libmyReactionDriven.so"
);

// ************************************************************************* //
