Case_2/1mainRun/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type populationBalanceMultiphaseSystem;

phases (particles gas);

populationBalances ();

particles
{
    type          multiComponentPhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               125e-6;
		storeA              on;
    }
	
    alphaMax        0.55;
    
	residualAlpha   1e-15;
}
gas
{
    type          reactingPhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               1e-5;
    }

    alphaMin        0.45;
	
    residualAlpha   1e-5;
}

blending
{
    default
    {
        type            none;
        continuousPhase gas;
    }
}

surfaceTension
(
    (particles and gas)
    {
        type            constant;
        sigma           0;
    }
);

aspectRatio
();

drag
(
    (particles in gas)
    {
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (particles in gas)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
(
    (particles in gas)
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
);

phaseTransfer
(
	(particles in gas)
    {
        type myReactionDriven;
        reactingPhase gas;
        otherPhase gas;
        species (HF_s);
    }
);

lift
();

wallLubrication
();

turbulentDispersion
();

interfaceCompression
();

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
